[
  {
    "title": "Exploring Hidden Worlds",
    "description": "We are becoming more dependent on technology, and yet fewer people know how it works. Software should not be created behind closed doors especially when it can have larger ramifications on our day-to-day lives. Exploring Hidden Worlds aims to lift the veil on what it takes to build modern software through an explorable 3D visualization. Through learning what it takes to build modern software, and having the ability to understand it people can have more agency when deciding whether to adopt new, potentially harmful, technologies.",
    "tags": [
      "computer science, ",
      "design"
    ],
    "img": "/assets/images/exploring_hidden_worlds.png",
    "year": 2023,
    "url": "https://matt-blanco.github.io/Exploring-Hidden-Worlds/"
  },
  {
    "title": "Our Changing Lands",
    "description": "A semester long project focused on rethinking our relationship to the outdoors. Organized as three parts: a poster, dimensional, and screen based series all focused on the same social cause and to practice different aspects of design.",
    "tags": [
      "design"
    ],
    "img": "/assets/images/our_changing_lands.png",
    "year": 2023,
    "url": "https://assets.adobe.com/id/urn:aaid:sc:US:89a72a47-50b4-4407-ad4a-03089bb695c5?view=published"
  },
  {
    "title": "Banca Intesa Processes",
    "description": "As a student developer & researcher at the Center for Design I worked with a team alongside Banca IntesaSanpaolo, Italy's largest bank, to create a visualization interface to explore auditing risk and management data throughout different levels of the company",
    "tags": [
      "computer science, ",
      "design"
    ],
    "img": "/assets/images/banca_intesa.jpg",
    "year": 2023,
    "url": "https://nu-center-for-design.github.io/banca-process/"
  },
  {
    "title": "NUHOC on Film",
    "description": "What makes a community? Is it the shared common interests amongst a group of people or the people themselves? Shot using Super8 film \"NUHOC on Film\" captures the hidden history of why some of its members stuck around and showcasing what matters most: people.",
    "tags": [
      "design"
    ],
    "img": "/assets/images/nuhoc_on_film.jpg",
    "year": 2022,
    "url": "https://www.youtube.com/watch?v=MZDFxir7_3s"
  },
  {
    "title": "Olli",
    "description": "While working for the MIT Visualization Group I developed version 1 of Olli. Olli is an open-source library for converting data visualizations into accessible text structures for screen reader users. Starting with an existing visualization specification created with a supported toolkit, Olli produces a keyboard-navigable tree view with descriptions at varying levels of detail. Users can explore these structures both to get an initial overview, and to dive into the data in more detail.",
    "tags": [
      "computer science, ",
      "design"
    ],
    "img": "/assets/images/olli.png",
    "year": 2022,
    "url": "https://mitvis.github.io/olli/"
  },
  {
    "title": "Excelsior",
    "description": "The Northeastern University Huskiers and Outing Club semi-yearly magazine. Had the opportunity to design the cover and spreads of the 2022 edition combining member written stories with engaging photography taken throughout the semester.",
    "tags": [
      "design"
    ],
    "img": "/assets/images/excelsior.png",
    "year": 2022,
    "url": ""
  },
  {
    "title": "Poster a Day",
    "description": "Practicing graphic design skills by creating a unique poster evey day and posting it on my social media.",
    "tags": [
      "design"
    ],
    "img": "/assets/images/hopper.png",
    "year": 2021,
    "url": "https://photos.app.goo.gl/62cRfi9oX3rG4dWA7"
  }
]